// 소스출처 : http://www.kma.go.kr/weather/forecast/digital_forecast.jsp  내부에 있음
// 기상청에서 이걸 왜 공식적으로 공개하지 않을까?
//
// (사용 예)
// var rs = dfs_xy_conv("toLL","60","127");
// console.log(rs.lat, rs.lng);
//
    //<!--
    //
    // LCC DFS 좌표변환을 위한 기초 자료
    //
    var RE = 6371.00877; // 지구 반경(km)
    var GRID = 5.0; // 격자 간격(km)
    var SLAT1 = 30.0; // 투영 위도1(degree)
    var SLAT2 = 60.0; // 투영 위도2(degree)
    var OLON = 126.0; // 기준점 경도(degree)
    var OLAT = 38.0; // 기준점 위도(degree)
    var XO = 43; // 기준점 X좌표(GRID)
    var YO = 136; // 기1준점 Y좌표(GRID)
    //
    // LCC DFS 좌표변환 ( code : "toXY"(위경도->좌표, v1:위도, v2:경도), "toLL"(좌표->위경도,v1:x, v2:y) )
    //


    function dfs_xy_conv(code, v1, v2) {
        var DEGRAD = Math.PI / 180.0;
        var RADDEG = 180.0 / Math.PI;

        var re = RE / GRID;
        var slat1 = SLAT1 * DEGRAD;
        var slat2 = SLAT2 * DEGRAD;
        var olon = OLON * DEGRAD;
        var olat = OLAT * DEGRAD;

        var sn = Math.tan(Math.PI * 0.25 + slat2 * 0.5) / Math.tan(Math.PI * 0.25 + slat1 * 0.5);
        sn = Math.log(Math.cos(slat1) / Math.cos(slat2)) / Math.log(sn);
        var sf = Math.tan(Math.PI * 0.25 + slat1 * 0.5);
        sf = Math.pow(sf, sn) * Math.cos(slat1) / sn;
        var ro = Math.tan(Math.PI * 0.25 + olat * 0.5);
        ro = re * sf / Math.pow(ro, sn);
        var rs = {};
        if (code == "toXY") {
            rs['lat'] = v1;
            rs['lng'] = v2;
            var ra = Math.tan(Math.PI * 0.25 + (v1) * DEGRAD * 0.5);
            ra = re * sf / Math.pow(ra, sn);
            var theta = v2 * DEGRAD - olon;
            if (theta > Math.PI) theta -= 2.0 * Math.PI;
            if (theta < -Math.PI) theta += 2.0 * Math.PI;
            theta *= sn;
            rs['x'] = Math.floor(ra * Math.sin(theta) + XO + 0.5);
            rs['y'] = Math.floor(ro - ra * Math.cos(theta) + YO + 0.5);
        }
        else {
            rs['x'] = v1;
            rs['y'] = v2;
            var xn = v1 - XO;
            var yn = ro - v2 + YO;
            ra = Math.sqrt(xn * xn + yn * yn);
            if (sn < 0.0) - ra;
            var alat = Math.pow((re * sf / ra), (1.0 / sn));
            alat = 2.0 * Math.atan(alat) - Math.PI * 0.5;

            if (Math.abs(xn) <= 0.0) {
                theta = 0.0;
            }
            else {
                if (Math.abs(yn) <= 0.0) {
                    theta = Math.PI * 0.5;
                    if (xn < 0.0) - theta;
                }
                else theta = Math.atan2(xn, yn);
            }
            var alon = theta / sn + olon;
            rs['lat'] = alat * RADDEG;
            rs['lng'] = alon * RADDEG;
        }
        return rs;
    }




    
function cloesed_aws_point(lat,lon) {
    var aws_points = [
            [90,38.25085,128.56473],
            [93,37.94738,127.75443],
            [95,38.14787,127.3042],
            [98,37.90188,127.0607],
            [99,37.88589,126.76648],
            [100,37.67713,128.71834],
            [101,37.90262,127.7357],
            [102,37.97396,124.71241],
            [104,37.80456,128.85535],
            [105,37.75147,128.89099],
            [106,37.50709,129.12433],
            [108,37.57142,126.9658],
            [112,37.47772,126.6249],
            [114,37.33749,127.94659],
            [115,37.48129,130.89864],
            [119,37.25746,126.983],
            [121,37.18126,128.45743],
            [127,36.97045,127.9525],
            [129,36.77658,126.4939],
            [130,36.99176,129.41278],
            [131,36.63924,127.44066],
            [133,36.37198,127.37211],
            [135,36.22025,127.99458],
            [136,36.57293,128.70734],
            [137,36.40837,128.15741],
            [138,36.03201,129.38002],
            [140,36.0053,126.76135],
            [143,35.87797,128.65295],
            [146,35.8408,127.119],
            [152,35.5825,129.33472],
            [155,35.1702,128.57285],
            [156,35.17294,126.89158],
            [159,35.10468,129.03203],
            [162,34.84546,128.4356],
            [165,34.81732,126.38151],
            [168,34.73929,127.74064],
            [169,34.68719,125.45103],
            [170,34.39587,126.70184],
            [172,35.3489,126.599],
            [174,35.0204,127.3694],
            [177,36.65759,126.68772],
            [184,33.51411,126.52969],
            [185,33.29382,126.16283],
            [188,33.38677,126.8802],
            [189,33.24616,126.5653],
            [192,35.16379,128.04002],
            [201,37.70739,126.44634],
            [202,37.48863,127.49446],
            [203,37.26399,127.48421],
            [211,38.05986,128.16714],
            [212,37.6836,127.88043],
            [216,37.17038,128.98929],
            [217,37.38149,128.6459],
            [221,37.15928,128.19434],
            [226,36.48761,127.73415],
            [232,36.7624,127.2927],
            [235,36.32724,126.55744],
            [236,36.27242,126.92079],
            [238,36.10563,127.48175],
            [239,36.48639,127.235],
            [243,35.72954,126.71655],
            [244,35.61203,127.28556],
            [245,35.56306,126.83917],
            [247,35.42129,127.39652],
            [248,35.65695,127.52029],
            [251,35.4266,126.697],
            [252,35.283672,126.47779],
            [253,35.22666,128.893],
            [254,35.3714,127.1286],
            [255,35.2264,128.6725],
            [257,35.3072,129.02],
            [258,34.7633,127.2123],
            [259,34.6261,126.7689],
            [260,34.68875,126.91949],
            [261,34.55375,126.56907],
            [262,34.61826,127.27572],
            [263,35.3226,128.2881],
            [264,35.5114,127.7454],
            [266,34.9434,127.69141],
            [268,34.4731,126.2585],
            [271,36.94361,128.91449],
            [272,36.87183,128.51688],
            [273,36.62727,128.14879],
            [276,36.4351,129.04005],
            [277,36.53337,129.40926],
            [278,36.3561,128.68864],
            [279,36.13055,128.32056],
            [281,35.97742,128.9514],
            [283,35.8174,129.2009],
            [284,35.6674,127.909],
            [285,35.56503,128.16986],
            [288,35.49148,128.7441],
            [289,35.41299,127.8791],
            [294,34.88818,128.60452],
            [295,34.81662,127.92641]
        ];

        // aws spot과의 거리 계산
        let distance = new Array(aws_points.length).fill(100000.0);
        for (var i = 0; i < aws_points.length; i++) {
            distance[i] = Math.sqrt( (aws_points[i][1]-lat)**2 + (aws_points[i][2]-lon)**2 );
        }

        // 거리 중 최소인 어레이 인덱스
        min_distance_idx = distance.indexOf(Math.min.apply(null, distance.filter(function(n) { return !isNaN(n); })) );

        // 최소 거리 지점 리턴
        return closest_point = aws_points[ min_distance_idx ][0];
    }
    //-->